# Submission 1
#### For Python Level 3, Prepare Level 2, and Access Level 3

##### Access Level 3
Access data from both common and uncommon formats and identify best practices for formats in different contexts. 
<p>
There are many different ways to access data in Pandas, whether you want to read into a more common format such as a CSV file, or if you to access data stored in an HDF5 table or in SAS format. 
</p>
<p> 
When considering which format to use, you should also note the different types of separators that are the defaults of each method. For example, pd.read_csv defaults separation to a comma, while pd.read_table defaults to'\t'. Different file types also come with different parameters (whether optional or required) according to their designated Pandas function. 
</p>
<p>
For a contextual example, consider pd.read_sql_table, pd.read_sql_query, and pd.read_sql. Although these functions seem very similar to each other, there are actually quite a few key differences. The list below describes each method and how you can use them.
</p>

**pd.read_sql_table** 
* Reads an SQL database table into a DataFrame
* Takes in parse_dates, columns, chunksize
* Does not support DBAPI connections

**pd.read_sql_query**
* Reads an SQL query into a DataFrame
* Takes in parse_dates, chunksize
* May support DBAPI connections depending on type

**pd.read_sql** 
* Read SQL query or database table into a DataFrame
* More for convenience, compatibility for previous methods
* Takes in parse_dates, columns, chunksize

Now, I will be using SQLite to access the database for a dataset called **Simple Folk**.
<p>
Link to database: http://2016.padjo.org/files/data/starterpack/simplefolks.sqlite

In [7]:
import sqlite3
import pandas as pd
con = sqlite3.connect('simplefolks.sqlite')
cur = con.cursor()
rows = cur.fetchall()

In [10]:
# DataFrame with the age, sex, and name of individuals
people_df = pd.read_sql_query("SELECT age, sex, name FROM people", con)
# DataFrame with pets, pet owners, and pet names
pet_df = pd.read_sql_query("SELECT name, owner_name FROM pets ORDER BY name", con)

In [14]:
# Viewing DataFrames
people_df.head()

   age sex      name
0   33   M    Austin
1   90   M     Blair
2   28   F  Carolina
3   41   F      Dani
4   70   M    Donald

In [16]:
# Viewing DataFrames
pet_df.head()

      name owner_name
0  Artemis       Dani
1  Bumpkin   Georgina
2   Donald     Donald
3     Essy     Sherry
4  Harambe       Dani

Now, let's say we wanted to list all of the 30 year old and older men in the people table. We can do this by implementing the query below.

In [18]:
query_1 = pd.read_sql_query("SELECT * FROM people WHERE sex = 'M' AND age >= 30", con)
query_1

      name sex  age
0   Austin   M   33
1    Blair   M   90
2   Donald   M   70
3  Michael   M   48
4      Zed   M   42

Or, with the pet table we can find the pets name and type that are not dogs or cats. Personally, the bird named Harambe is my favorite.

In [20]:
query_2 = pd.read_sql_query("SELECT name, type FROM pets WHERE type != 'cat' and TYPE != 'dog'", con)
query_2

           name   type
0       Harambe   bird
1         Hodor   bird
2       Bumpkin  horse
3   Secretariat  horse
4  Harry Potter  horse
5        Xerses  horse
6       Jenkins  horse

Luckily for us, SQLite databases and their respective tables usually come in a very easy-to-read format. In other cases where the data is not as easy to read in, we need to be able to clean and prepare it.

##### Prepare Level 2
Apply data reshaping, cleaning, and filtering as directed.